_posts/2022-01-01-boj-8983.html
---
title: BOJ 8983 사냥꾼
tags: 이분탐색
---

<div id="outline-container-orga3d4274" class="outline-2">
<h2 id="orga3d4274">BOJ 8983 사냥꾼</h2>
<div class="outline-text-2" id="text-orga3d4274">
<ul class="org-ul">
<li></li>
</ul>
</div>
</div>
<div id="outline-container-orgd6453a2" class="outline-2">
<h2 id="orgd6453a2">접근하기</h2>
<div class="outline-text-2" id="text-orgd6453a2">
<pre class="example">
1. 동물에서 사대를 하나씩 찾아본다.
2. 사대는 y좌표가 0인 x좌표만으로 생각할 수 있음.
3. L보다 동물.y가 더 크면, 사정거리 밖임 -&gt; 걸러내기
4. L - 동물.y = xdiff
   -&gt; 동물.x + xdiff or 동물.x - xdiff
      사이에 발사대가 있으면, 사정거리 안쪽
</pre>
</div>
</div>

<div id="outline-container-orgf0dfad6" class="outline-2">
<h2 id="orgf0dfad6">코드 - STL lower bound &amp; upper bound 이용</h2>
<div class="outline-text-2" id="text-orgf0dfad6">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">M</span>, <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">L</span>;    
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a</span>[100010];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d %d"</span>, &amp;M, &amp;N, &amp;L);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;M;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;a[i]);
    }
    sort(a, a+M);
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ans</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ax</span>, <span style="color: #ff6347;">ay</span>;
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;ax, &amp;ay);
        <span style="color: #729fcf; font-weight: bold;">if</span> (ay - L &gt; 0) <span style="color: #729fcf; font-weight: bold;">continue</span>;
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">xdiff</span> = abs(L - ay);
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">is_found</span> = upper_bound(a, a+M, ax + xdiff) - lower_bound(a, a+M, ax - xdiff);
        <span style="color: #729fcf; font-weight: bold;">if</span> (is_found) ans++;
    }
    printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, ans);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8b45702" class="outline-2">
<h2 id="org8b45702">코드 - 스위핑</h2>
<div class="outline-text-2" id="text-org8b45702">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">M</span>, <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">L</span>;    
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a</span>[100010];

<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Animal</span> {
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">y</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">x</span>;
} <span style="color: #8ae234; font-weight: bold;">Animal</span>;

<span style="color: #8ae234; font-weight: bold;">Animal</span> <span style="color: #ff6347;">animal</span>[100010];

<span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #edd400; font-weight: bold;">comp</span>(<span style="color: #8ae234; font-weight: bold;">Animal</span>&amp; <span style="color: #ff6347;">p1</span>, <span style="color: #8ae234; font-weight: bold;">Animal</span>&amp; <span style="color: #ff6347;">p2</span>)
{
    <span style="color: #729fcf; font-weight: bold;">if</span> (p1.x == p2.x)
        <span style="color: #729fcf; font-weight: bold;">return</span> p1.y &lt; p2.y;
    <span style="color: #729fcf; font-weight: bold;">else</span>
        <span style="color: #729fcf; font-weight: bold;">return</span> p1.x &lt; p2.x;
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d %d"</span>, &amp;M, &amp;N, &amp;L);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;M;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;a[i]);
    }

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ax</span>, <span style="color: #ff6347;">ay</span>;
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;ax, &amp;ay);
        animal[i].x = ax;
        animal[i].y = ay;
    }
    sort(a, a+M);
    sort(animal, animal+N, comp);

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ans</span> = 0;

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">idx</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        <span style="color: #729fcf; font-weight: bold;">while</span>(idx != M-1 &amp;&amp; a[idx + 1] &lt;= animal[i].x) {
            idx++;    
        } <span style="color: #888a85;">// </span><span style="color: #888a85;">a[idx+1] &gt; animal[i].x &#51312;&#44148;&#50640;&#49436; loop &#51333;&#47308;</span>
        <span style="color: #888a85;">// </span><span style="color: #888a85;">a[idx+1] &#49324;&#45824; &#50724;&#47480;&#51901;</span>
        <span style="color: #888a85;">// </span><span style="color: #888a85;">a[idx] &#49324;&#45824; &#50812;&#51901;&#50640; &#51080;&#51020;</span>

        <span style="color: #729fcf; font-weight: bold;">if</span> (abs(a[idx] - animal[i].x) + animal[i].y &lt;= L)
            ans += 1; <span style="color: #888a85;">// </span><span style="color: #888a85;">&#46041;&#47932;&#44592;&#51456; &#50812;&#51901; &#48156;&#49324;&#45824;</span>
        <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span> (idx != M-1 &amp;&amp; abs(a[idx+1] - animal[i].x) + animal[i].y &lt;= L)
            ans += 1; <span style="color: #888a85;">// </span><span style="color: #888a85;">&#46041;&#47932;&#44592;&#51456; &#50724;&#47480;&#51901; &#48156;&#49324;&#45824;                   </span>
    }
    printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, ans);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfb1a48d" class="outline-2">
<h2 id="orgfb1a48d"><span class="todo TODO">TODO</span> 코드 - 이분탐색 구현</h2>
</div>

<div id="outline-container-org74b2013" class="outline-2">
<h2 id="org74b2013">문제 링크</h2>
<div class="outline-text-2" id="text-org74b2013">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/8983">https://www.acmicpc.net/problem/8983</a></li>
</ul>
</div>
</div>
